stm32-rs/stm32g4xx-hal/src/serial/usart.rs
        impl<Pin> hal::serial::Read<u8> for Rx<$USARTX, Pin, NoDMA> {
            type Error = Error;

            fn read(&mut self) -> nb::Result<u8, Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                let isr = usart.isr().read();
                Err(
                    if isr.pe().bit_is_set() {
                        usart.icr().write(|w| w.pecf().set_bit());
                        nb::Error::Other(Error::Parity)
                    } else if isr.fe().bit_is_set() {
                        usart.icr().write(|w| w.fecf().set_bit());
                        nb::Error::Other(Error::Framing)
                    } else if isr.nf().bit_is_set() {
                        usart.icr().write(|w| w.ncf().set_bit());
                        nb::Error::Other(Error::Noise)
                    } else if isr.ore().bit_is_set() {
                        usart.icr().write(|w| w.orecf().set_bit());
                        nb::Error::Other(Error::Overrun)
                    } else if isr.rxne().bit_is_set() {
                        return Ok(usart.rdr().read().bits() as u8)
                    } else {
                        nb::Error::WouldBlock
                    }
                )
            }
        }

        impl<TX, RX> hal::serial::Read<u8> for Serial<$USARTX, TX, RX> {
            type Error = Error;

            fn read(&mut self) -> nb::Result<u8, Error> {
                self.rx.read()
            }
        }

        impl<Pin, Dma> Tx<$USARTX, Pin, Dma> {
            /// Starts listening for an interrupt event
            pub fn listen(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1().modify(|_, w| w.txeie().set_bit());
            }

            /// Stop listening for an interrupt event
            pub fn unlisten(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1().modify(|_, w| w.txeie().clear_bit());
            }

            /// Return true if the tx register is empty (and can accept data)
            pub fn is_txe(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr().read().txe().bit_is_set()
            }

            /// Returns true if the tx fifo threshold has been reached.
            pub fn fifo_threshold_reached(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr().read().txft().bit_is_set()
            }

            pub fn clear_transmission_complete(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.icr().write(|w| w.tccf().set_bit());
            }
        }

        impl<Pin> Tx<$USARTX, Pin, NoDMA> {
            pub fn enable_dma<STREAM, BUF>(self, mut stream: STREAM, memory: BUF) -> Tx<$USARTX, Pin, DMA<STREAM, BUF>>
            where
                STREAM: crate::dma::traits::Stream<Config = crate::dma::config::DmaConfig>,
                BUF: embedded_dma::StaticReadBuffer<Word = u8>
            {
                // NOTE(unsafe) critical section prevents races
                interrupt::free(|_| unsafe {
                    let cr3 = &(*$USARTX::ptr()).cr3();
                    cr3.modify(|_, w| w.dmat().set_bit());
                });

                stream.disable();

                core::sync::atomic::fence(core::sync::atomic::Ordering::SeqCst);

                // Set peripheral to memory mode
                stream.set_direction(crate::dma::DmaDirection::MemoryToPeripheral);

                // NOTE(unsafe) We now own this buffer and we won't call any &mut
                // methods on it until the end of the DMA transfer
                let (buf_ptr, buf_len) = unsafe { memory.read_buffer() };

                // Set the memory address
                //
                // # Safety
                //
                // Must be a valid memory address
                unsafe {
                    stream.set_memory_address(
                        buf_ptr as u32,
                    );
                }

                // Set the peripheral address or the source address in memory-to-memory mode
                //
                // # Safety
                //
                // Must be a valid peripheral address or source address
                let write_register_address = &unsafe { &*<$USARTX>::ptr() }.tdr() as *const _ as u32;
                unsafe { stream.set_peripheral_address(write_register_address); }

                assert!(
                    buf_len <= 65535,
                    "Hardware does not support more than 65535 transfers"
                );

                // Set the DMAMUX request line
                stream.set_request_line(DmaMuxResources::$dmamux_tx as u8);

                let msize = core::mem::size_of::<u8>() / 2;

                stream.clear_interrupts();

                // NOTE(unsafe) These values are correct because of the
                // invariants of TargetAddress
                unsafe {
                    stream.set_memory_size(msize as u8);
                    stream.set_peripheral_size(msize as u8);
                }

                let config = crate::dma::config::DmaConfig::default()
                    .transfer_complete_interrupt(false)
                    .circular_buffer(false)
                    .memory_increment(true)
                    .priority(crate::dma::config::Priority::Low);
                stream.apply_config(config);

                Tx {
                    pin: self.pin,
                    usart: self.usart,
                    dma: DMA{ stream, memory },
                }
            }
        }

        impl<Pin, T, M> embedded_io::Write for Tx<$USARTX, Pin, DMA<T, M>>
        where
            T: Stream,
            M: embedded_dma::StaticReadBuffer + core::ops::DerefMut,
            <M as core::ops::Deref>::Target: core::ops::IndexMut<core::ops::Range<usize>, Output = [u8]>,
        {
            fn write(&mut self, buf: &[u8]) -> Result<usize, Self::Error> {
                use core::sync::atomic::fence;

                let (_p, buffer_capacity) = unsafe { self.dma.memory.read_buffer() };
                let count = buf.len().min(buffer_capacity);

                embedded_io::Write::flush(self)?;

                fence(core::sync::atomic::Ordering::SeqCst);
                self.dma.stream.disable();

                fence(core::sync::atomic::Ordering::SeqCst);

