stm32-rs/stm32g4xx-hal/src/serial/usart.rs
                self.dma.memory[0..count].copy_from_slice(&buf[0..count]);
                self.dma.stream.set_number_of_transfers(count as u16);

                fence(core::sync::atomic::Ordering::SeqCst);

                unsafe {
                    self.clear_transmission_complete();
                    self.dma.stream.enable();
                }

                Ok(count)
            }

            fn flush(&mut self) -> Result<(), Self::Error> {
                while T::get_number_of_transfers() > 0 {
                    assert!(!T::get_transfer_error_flag());
                }
                self.dma.stream.clear_transfer_complete_interrupt();
                assert!(!T::get_transfer_error_flag());
                Ok(())
            }
        }

        impl<Pin> hal::serial::Write<u8> for Tx<$USARTX, Pin, NoDMA> {
            type Error = Error;

            fn flush(&mut self) -> nb::Result<(), Self::Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                if usart.isr().read().tc().bit_is_set() {
                    Ok(())
                } else {
                    Err(nb::Error::WouldBlock)
                }
            }

            fn write(&mut self, byte: u8) -> nb::Result<(), Self::Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                if usart.isr().read().txe().bit_is_set() {
                    usart.tdr().write(|w| unsafe { w.bits(byte as u32) });
                    Ok(())
                } else {
                    Err(nb::Error::WouldBlock)
                }
            }
        }

        impl<TX, RX> hal::serial::Write<u8> for Serial<$USARTX, TX, RX> {
            type Error = Error;

            fn flush(&mut self) -> nb::Result<(), Self::Error> {
                self.tx.flush()
            }

            fn write(&mut self, byte: u8) -> nb::Result<(), Self::Error> {
                self.tx.write(byte)
            }
        }


        impl<TX, RX> Serial<$USARTX, TX, RX> {

            /// Separates the serial struct into separate channel objects for sending (Tx) and
            /// receiving (Rx)
            pub fn split(self) -> (Tx<$USARTX, TX, NoDMA>, Rx<$USARTX, RX, NoDMA>) {
                (self.tx, self.rx)
            }

            /// Joins the objects created by `split()` back into one Serial object.
            ///
            /// This function can be used in combination with `release()` to deinitialize the
            /// peripheral after it has been split.
            pub fn join(
                tx: Tx<$USARTX, TX, NoDMA>,
                rx: Rx<$USARTX, RX, NoDMA>,
            ) -> Self {
                Serial{
                    tx,
                    rx,
                }
            }

            /// Disables the USART and returns the peripheral as well the pins.
            ///
            /// This function makes the components available for further use. For example, the
            /// USART can later be reinitialized with a different baud rate or other configuration
            /// changes.
            pub fn release(self) -> ($USARTX, TX, RX) {
                // Disable the UART as well as its clock.
                self.tx.usart.cr1().modify(|_, w| w.ue().clear_bit());
                unsafe {
                    let rcc_ptr = &(*RCC::ptr());
                    $USARTX::disable(rcc_ptr);
                }
                (self.tx.usart, self.tx.pin, self.rx.pin)
            }
        }

        unsafe impl<Pin> TargetAddress<MemoryToPeripheral> for Tx<$USARTX, Pin, DMAOld> {
            #[inline(always)]
            fn address(&self) -> u32 {
                // unsafe: only the Tx part accesses the Tx register
                &unsafe { &*<$USARTX>::ptr() }.tdr() as *const _ as u32
            }

            type MemSize = u8;

            const REQUEST_LINE: Option<u8> = Some(DmaMuxResources::$dmamux_tx as u8);
        }

        unsafe impl<Pin> TargetAddress<PeripheralToMemory> for Rx<$USARTX, Pin, DMAOld> {
            #[inline(always)]
            fn address(&self) -> u32 {
                // unsafe: only the Rx part accesses the Rx register
                &unsafe { &*<$USARTX>::ptr() }.rdr() as *const _ as u32
            }

            type MemSize = u8;

            const REQUEST_LINE: Option<u8> = Some(DmaMuxResources::$dmamux_rx as u8);
        }
    }
}

macro_rules! uart_lp {
    ($USARTX:ident,
        $usartX:ident, $clk_mul:expr
    ) => {
        impl SerialExt<$USARTX, LowPowerConfig> for $USARTX {
            fn usart<TX, RX>(
                self,
                tx: TX,
                rx: RX,
                config: LowPowerConfig,
                rcc: &mut Rcc,
            ) -> Result<Serial<$USARTX, TX, RX>, InvalidConfig>
            where
                TX: TxPin<$USARTX>,
                RX: RxPin<$USARTX>,
            {
                Serial::$usartX(self, tx, rx, config, rcc)
            }
        }

        impl<TX, RX> Serial<$USARTX, TX, RX>
        where
            TX: TxPin<$USARTX>,
            RX: RxPin<$USARTX>,
        {
            pub fn $usartX(
                usart: $USARTX,
                tx: TX,
                rx: RX,
                config: LowPowerConfig,
                rcc: &mut Rcc,
            ) -> Result<Self, InvalidConfig> {
                // Enable clock for USART
                unsafe {
                    let rcc_ptr = &(*RCC::ptr());
                    $USARTX::enable(rcc_ptr);
                    $USARTX::reset(rcc_ptr);
                }

                // TODO: By default, all UARTs are clocked from PCLK. We could modify RCC_CCIPR to
                // try SYSCLK if PCLK is not high enough. We could also select 8x oversampling
                // instead of 16x.

                let clk = <$USARTX as RccBus>::Bus::get_frequency(&rcc.clocks).raw() as u64;
                let bdr = config.baudrate.0 as u64;
                let div = ($clk_mul * clk) / bdr;
                if div < 16 {
                    // We need 16x oversampling.
                    return Err(InvalidConfig);
                }
                usart.brr().write(|w| unsafe { w.bits(div as u32) });
                // Reset the UART and disable it (UE=0)
                usart.cr1().reset();
                // Reset other registers to disable advanced USART features
                usart.cr2().reset();
                usart.cr3().reset();

                usart.cr2().write(|w| unsafe {
                    w.stop()
                        .bits(config.stopbits.bits())
                        .swap()
                        .bit(config.swap)
                });

                usart.cr3().write(|w| unsafe {
                    w.txftcfg()
                        .bits(config.tx_fifo_threshold.bits())
                        .rxftcfg()
                        .bits(config.rx_fifo_threshold.bits())
                        .txftie()
                        .bit(config.tx_fifo_interrupt)
                        .rxftie()
                        .bit(config.rx_fifo_interrupt)
                });

                // Enable the UART and perform remaining configuration.
                usart.cr1().write(|w| {
                    w.ue()
                        .set_bit()
                        .te()
                        .set_bit()
                        .re()
                        .set_bit()
                        .m0()
                        .bit(config.wordlength == WordLength::DataBits9)
                        .m1()
                        .bit(config.wordlength == WordLength::DataBits7)
                        .pce()
                        .bit(config.parity != Parity::ParityNone)
                        .ps()
                        .bit(config.parity == Parity::ParityOdd)
                        .fifoen()
                        .bit(config.fifo_enable)
                });

